cmsis-svd/cmsis-svd/data/Nuvoton/NUC029GE_v1.svd
       <register>
          <name>SYS_SRAM_BISTSTS</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>SYS_SRAM_BISTSTS</displayName>
          <description>System SRAM BIST Test Status Register</description>
          <addressOffset>0xD4</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFF00FF00</resetMask>
          <fields>
            <field>
              <name>SRBISTEF</name>
              <description>System SRAM BIST Fail Flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>System SRAM BIST test pass</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>System SRAM BIST test fail</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>CRBISTEF</name>
              <description>CACHE SRAM BIST Fail Flag</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>System CACHE RAM BIST test pass</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>System CACHE RAM BIST test fail</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>USBBEF</name>
              <description>USB SRAM BIST Fail Flag</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>USB SRAM BIST test pass</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>USB SRAM BIST test fail</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>SRBEND</name>
              <description>SRAM BIST Test Finish</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>System SRAM BIST active</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>System SRAM BIST finish</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>CRBEND</name>
              <description>CACHE SRAM BIST Test Finish</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>System CACHE RAM BIST is active</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>System CACHE RAM BIST test finish</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>USBBEND</name>
              <description>USB SRAM BIST Test Finish</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>USB SRAM BIST is active</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>USB SRAM BIST test finish</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
          </fields>
       </register>
       <register>
          <name>SYS_REGLCTL</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>SYS_REGLCTL</displayName>
          <description>Register Lock Control Register</description>
          <addressOffset>0x100</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>REGLCTL0</name>
              <description>Register Lock Control Disable Index (Read Only)\nThe Protected registers are:\nSYS_IPRST0: address 0x5000_0008Reserved.\nSYS_BODCTL: address 0x5000_0018\nSYS_PORCTL: address 0x5000_0024\nSYS_VREFCTL: address 0x5000_0028\nSYS_SRAM_BISTCTL: address 0x5000_00D0Reserved.Reserved.\nCLK_PWRCTL[13]: address 0x5000_0200 (HIRC48 Enable Bit)\nCLK_PWRCTL[12]: address 0x5000_0200 (HXT Crystal Type Select Bit)\nCLK_PWRCTL[11:10]: address 0x5000_0200 (HXT Gain Control Bit)\nCLK_PWRCTL[7]: address 0x5000_0200 (System Power-down Enable)\nCLK_PWRCTL[5]: address 0x5000_0200 (Power-down Mode Wake-up Interrupt Enable Bit)\nCLK_PWRCTL[4]: address 0x5000_0200 (Enable the Wake-up Delay Counter)\nCLK_PWRCTL[3]: address 0x5000_0200 (LIRC Enable Bit)\nCLK_PWRCTL[2]: address 0x5000_0200 (HIRC Enable Bit)\nCLK_PWRCTL[1]: address 0x5000_0200 (LXT Enable Bit)\nCLK_PWRCTL[0]: address 0x5000_0200 (HXT Enable Bit)\nCLK_APBCLK0 [0]: address 0x5000_0208 (bit[0] is watchdog clock enable)\nCLK_CLKSEL0: address 0x5000_0210 (for HCLK and CPU STCLK clock source select)\nCLK_CLKSEL1 [1:0]: address 0x5000_0214 (for watchdog clock source select)\nCLK_CLKSEL3[8]:  address 0x5000_0234 (USBD Clock Source Selection)\nCLK_CLKDSTS: address 0x5000_0274\nFMC_ISPCTL: address 0x5000_C000 (Flash ISP Control register)\nFMC_ISPTRG: address 0x5000_C010 (ISP Trigger Control register)\nFMC_ISPSTS: address 0x5000_C040\nWDT_CTL: address 0x4000_4000\nFMC_FTCTL: address 0x5000_C018\nPWM0_CTL: address 0x4004_0000 \nPWM1_CTL: address 0x4014_0000\nPWM0_DTCTL0_1: address 0x4004_0070\nPWM1_DTCTL0_1: address 0x4014_0070\nPWM0_DTCTL2_3: address 0x4004_0074\nPWM1_DTCTL2_3: address 0x4014_0074\nPWM0_DTCTL4_5: address 0x4004_0078\nPWM1_DTCTL4_5: address 0x4014_0078\nPWM0_BRKCTL0_1: address 0x4004_00C8\nPWM1_BRKCTL0_1: address 0x4014_00C8\nPWM0_BRKCTL2_3: address 0x4004_00CC\nPWM1_BRKCTL2_3: address 0x4014_00CC\nPWM0_BRKCTL4_5: address 0x4004_00D0\nPWM1_BRKCTL4_5: address 0x4014_00D0\nPWM0_INTEN1: address 0x4004_00E4\nPWM1_INTEN1: address 0x4014_00E4\nPWM0_INTSTS1: address 0x4004_00EC\nPWM1_INTSTS1: address 0x4014_00ECReserved.\nTIMER0_PWMCTL: address 0x4001_0040\nTIMER1_PWMCTL: address 0x4001_0140\nTIMER2_PWMCTL: address 0x4011_0040\nTIMER3_PWMCTL: address 0x4011_0140\nTIMER0_PWMDTCTL: address 0x4001_0058\nTIMER1_PWMDTCTL: address 0x4001_0158\nTIMER2_PWMDTCTL: address 0x4011_0058\nTIMER3_PWMDTCTL: address 0x4011_0158\nTIMER0_PWMBRKCTL: address 0x4001_0070\nTIMER1_PWMBRKCTL: address 0x4001_0170\nTIMER2_PWMBRKCTL: address 0x4011_0070\nTIMER3_PWMBRKCTL: address 0x4011_0170\nTIMER0_PWMSWBRK: address 0x4001_007C\nTIMER1_PWMSWBRK: address 0x4001_017C\nTIMER2_PWMSWBRK: address 0x4011_007C\nTIMER3_PWMSWBRK: address 0x4011_017C\nTIMER0_PWMINTEN1: address 0x4001_0084\nTIMER1_PWMINTEN1: address 0x4001_0184\nTIMER2_PWMINTEN1: address 0x4011_0084\nTIMER3_PWMINTEN1: address 0x4011_0184\nTIMER0_PWMINTSTS1: address 0x4001_008C\nTIMER1_PWMINTSTS1: address 0x4001_018C\nTIMER2_PWMINTSTS1: address 0x4011_008C\nTIMER3_PWMINTSTS1: address 0x4011_018C</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Write-protection Enabled for writing protected registers. Any write to the protected register is ignored</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Write-protection Disabled for writing protected registers</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>REGLCTL</name>
              <description>Register Lock Control Code (Write Only)\nSome registers have write-protection function. Writing these registers have to disable the protected function by writing the sequence value '59h', '16h', '88h' to this field. After this sequence is completed, the REGLCTL bit will be set to 1 and write-protection registers can be normal write.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>7</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
       </register>
       <register>
          <name>SYS_TSOFFSET</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>SYS_TSOFFSET</displayName>
          <description>Temperature Sensor Offset Register</description>
          <addressOffset>0x114</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFF000</resetMask>
          <fields>
            <field>
              <name>VTEMP</name>
              <description>Temperature Sensor Offset Value \nThis field reflects temperature sensor output voltage offset at 25oC from Flash.Reserved.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
       </register>
